# -*- coding:utf-8 -*-
from math import sqrt

def similarity(tfidf1, tfidf2):
	tfidf2_dict = {key:value for key, value in tfidf2}

	ab = 0
	for key, value in tfidf1:
		value2 = tfidf2_dict.get(key)
		if value2:
			ab += float(value*value2)

	a = sqrt(sum([v**2 for k,v in tfidf1]))
	b = sqrt(sum([v**2 for k,v in tfidf2]))

	return float(ab/(a*b))
	
ikuyo_kuruyo = [
	['京都', 0.131578947369],
    ['漫才', 0.122807017544],
    ['お笑い', 0.122807017544],
    ['ラジオ', 0.105263157894],
    ['吉本興業', 0.09649122807],
    ['芸人', 0.09649122807],
    ['いくよ', 0.0701754385966],
    ['コンビ', 0.0701754385966],
    ['大阪', 0.0526315789474],
    ['名人', 0.0438596491229],
    ['上方', 0.0438596491229],
    ['花王', 0.0438596491229],
]

chikichiki = [
    ['お笑い', 0.169014084507],
    ['西野', 0.12676056338],
    ['大阪', 0.112676056338],
    ['ナダル', 0.0845070422536],
    ['コンビ', 0.0845070422536],
    ['優勝', 0.0704225352114],
    ['コロコロチキチキペッパーズ', 0.0704225352114],
    ['ネタ', 0.0704225352114],
    ['芸人', 0.056338028169],
    ['吉本興業', 0.056338028169],
    ['漫才', 0.056338028169],
    ['キングオブコント', 0.0422535211267],
]

print similarity(ikuyo_kuruyo, chikichiki)